#### ExternalResourceServerUtils Members

---

|  |
| --- |
| ExternalResourceServerUtils Class   Methods   See Also |

The  ExternalResourceServerUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | IsValidShortName | Checks whether the name is a valid short name for the external resource server. |
| Public method Static member | ServerSupportsAssemblyCodeData | Checks that the server referenced by the given ExternalResourceReference supports AssemblyCodeData. |
| Public method Static member | ServerSupportsCADLinks | Checks that the server referenced by the given ExternalResourceReference supports CAD links. |
| Public method Static member | ServerSupportsIFCLinks | Checks that the server referenced by the given ExternalResourceReference supports IFC links. |
| Public method Static member | ServerSupportsKeynotes | Checks that the server referenced by the given ExternalResourceReference supports KeynoteTable data. |
| Public method Static member | ServerSupportsRevitLinks | Checks that the server referenced by the given ExternalResourceReference supports Revit links. |

# See Also

ExternalResourceServerUtils Class

Autodesk.Revit.DB Namespace